feat: convert to mermaid
