--- a/doc/analisis-report.md
+++ b/doc/analisis-report.md
@@ -136,65 +134,53 @@ Admin -> S : Enlever la photo 2 de la liste
 
 #### Scenario Nominatif
 
-```plantuml
-@startuml
-actor APIs
-participant WallCaster as Sys
+```mermaid
+sequenceDiagram
+  actor APIs
+  participant Sys as WallCaster
 
-Sys -> APIs : Ask media contents
-APIs --> Sys : Sends media contents asked by APIs 
+Sys ->> APIs : Ask media contents
+APIs ->> Sys : Sends media contents asked by APIs 
 
-
-@enduml
 ```
 
 #### Scenario exception : authentification token expired
 
